# Задайте список из n чисел последовательности $(1 +\frac 1 n) ^ n$ и выведите на экран их сумму.
# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

n = int(input('Вывод cуммы чисел последовательности (1+1/n)^n\nВведите n:\nn = '))
if n < 1:
    print('Неверный ввод')
else:
    summ = 0

    print(f'n = {n}:', '{1: 2 ', end='')
    for i in range(2, n+1):
        summ += (1+1/i)**i
        print(f', {i}: {round(summ,2)}', end='')
    print('}')
